In [2]:
%autosave 120

Autosaving every 120 seconds

In [3]:
import pandas as pd
import xlrd
import numpy as np
import openpyxl as opx
import glob
import sys
import datetime
import xlwings as xl
import copy
from openpyxl.utils import range_boundaries
from fuzzywuzzy import fuzz
import pyodbc
import math as math
path = 'C:\\trial'
ticker_list =[] 
folder = glob.glob(path + '\\*')
company = [1]
import ast
c = 0
import configparser
con=configparser.ConfigParser()
con.read("C:\\Users\\admin\\thapovan\\Thapovan2\\Config.cfg")

C:\Users\admin\Anaconda3\lib\site-packages\fuzzywuzzy\fuzz.py:11: UserWarning: Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning
  warnings.warn('Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning')

['C:\\Users\\admin\\thapovan\\Thapovan2\\Config.cfg']

In [4]:
import pandas as pd
import os
import gensim
from gensim.utils import simple_preprocess
from gensim.parsing.preprocessing import STOPWORDS
from nltk.stem import WordNetLemmatizer, SnowballStemmer
from nltk.stem.porter import *
from nltk import PorterStemmer
stemmer = PorterStemmer()
import numpy as np
np.random.seed(2018)
import nltk
from nltk.stem.porter import PorterStemmer
from nltk.stem.wordnet import WordNetLemmatizer
nltk.download('wordnet')
lem = WordNetLemmatizer()
stem = PorterStemmer()
import re
import nltk
nltk.download('stopwords')
from nltk.corpus import stopwords
from nltk.stem.porter import PorterStemmer
from nltk.tokenize import RegexpTokenizer
from nltk.stem.wordnet import WordNetLemmatizer
stop_words = set(stopwords.words("english"))
new_words = ["using", "show", "result", "large", "also", "iv", "one", "two", "new", "previously", "shown"]
stop_words = stop_words.union(new_words)

[nltk_data] Downloading package wordnet to
[nltk_data]     C:\Users\admin\AppData\Roaming\nltk_data...
[nltk_data]   Package wordnet is already up-to-date!
[nltk_data] Downloading package stopwords to
[nltk_data]     C:\Users\admin\AppData\Roaming\nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

In [5]:
os.chdir("C:\\Users\\admin\\thapovan\\Thapovan2\\Corpus")
corpus_list = glob.glob("C:\\Users\\admin\\thapovan\\Thapovan2\\Corpus\*csv")

In [87]:
def spinning_cursor():
  #while True:
    for cursor in '\\-/|':
      time.sleep(0.5)
      # Use '\r' to move cursor back to line beginning
      # Or use '\b' to erase the last character
      sys.stdout.write('\r{}'.format(cursor))
      # Force Python to write data into terminal.

In [6]:
data1 = pd.read_csv("values1.csv", error_bad_lines=False)
data = pd.read_csv("Thapovan_data.csv", error_bad_lines=False)

In [7]:
def lemmatize_stemming(text):
    return stemmer.stem(WordNetLemmatizer().lemmatize(text, pos='v'))

In [8]:
def preprocess(text):
    result = []
    for token in gensim.utils.simple_preprocess(text):
        if token not in gensim.parsing.preprocessing.STOPWORDS and len(token) > 3:
            result.append(lemmatize_stemming(token))
    return result

In [9]:
def return_match_list(db,trial):
    p_list = []
    for i in range(0,len(trial)):
        metric = trial['trial'][i]
        text = re.sub('[^a-zA-Z]', ' ', metric)
    
        #Convert to lowercase
        text = text.lower()
    
        #remove tags
        text=re.sub("&lt;/?.*?&gt;"," &lt;&gt; ",text)
    
        # remove special characters and digits
        text=re.sub("(\\d|\\W)+"," ",text)
    
        ##Convert to list from string
        text = text.split()
    
        ##Stemming
        ps=PorterStemmer()
        #Lemmatisation
        lem = WordNetLemmatizer()
        text = [lem.lemmatize(word) for word in text if not word in  
            stop_words] 
        text = " ".join(text)
        tex_check = text.split(" ")
        list=[]
        for key in data1["Keyword"]:
            count = 0
            for j in tex_check:
                if(j in key):
                    count = count+1
            list.append((count/len(tex_check))*100)  
        l = []
        count1 = 0 
        maxi = max(list)
        for val in list:
            if(val==maxi):
                l.append(count1)
            count1 = count1+1 
        l2=[]
        for j in l:
            l2.append(data['Term'][j])
        p_list.append(l2)      
    trial['possible'] = p_list
    t_list = []
    for i in range(0,len(db)):
        metric = db['metric_name'][i]
        text = re.sub('[^a-zA-Z]', ' ', metric)
    
        #Convert to lowercase
        text = text.lower()
    
        #remove tags
        text=re.sub("&lt;/?.*?&gt;"," &lt;&gt; ",text)
    
        # remove special characters and digits
        text=re.sub("(\\d|\\W)+"," ",text)
    
        ##Convert to list from string
        text = text.split()
    
        ##Stemming
        ps=PorterStemmer()
        #Lemmatisation
        lem = WordNetLemmatizer()
        text = [lem.lemmatize(word) for word in text if not word in  
            stop_words] 
        text = " ".join(text)
        tex_check = text.split(" ")
        list=[]
        for key in data1["Keyword"]:
            count = 0
            for j in tex_check:
                if(j in key):
                    count = count+1
            list.append((count/len(tex_check))*100)  
        l = []
        count1 = 0 
        maxi = max(list)
        for val in list:
            if(val==maxi):
                l.append(count1)
            count1 = count1+1 
        l2=[]
        for j in l:
            l2.append(data['Term'][j])
        t_list.append(l2)    
    db['possible'] = t_list    
    final_list = []
    fill = []
    for i in range(0,len(trial)):
        metric = trial['possible'][i]
        final = []
        for j in range(0,len(db)):
            count = 0
            for k in db['possible'][j]:
                if(k in metric):
                    count = count+1
            final.append((count/len(db['possible'][j]))*100)
            l3 =[]
            for k in range(0,len(final)):
                if(final[k]>0):
                    l3.append(db['metric_name'][k])
        if(len(l3)==len(final)):
            final_list.append(fill)
        else:    
            final_list.append(l3) 
    return(final_list)

In [10]:
def ticker_dictionary_build(tick):
    #db_metrics = input("enter the name of the excel sheet with the database metrics for this particular ticker")
    #analyst_metrics = input("enter the name of the excel sheet with the analyst metrics for this particular ticker")
    print("Choose the name of the csv with the metrics from the database from the gven list. Enter the corresponding index number")
    for i in range(0,len(corpus_list)):
        print(str(i) +')' + corpus_list[i])
    db_metrics=corpus_list[int(input("Enter your choice:"))]
    print("Choose the name of the csv with the metrics from the analysts from the gven list. Enter the corresponding index number")
    for i in range(0,len(corpus_list)):
        print(str(i) +')' + corpus_list[i])
    analyst_metrics=corpus_list[int(input("Enter your choice:"))]
    db = pd.read_csv(db_metrics, error_bad_lines=False)
    trial = pd.read_csv(analyst_metrics, error_bad_lines=False)
    final_matches = return_match_list(db,trial)
    trial['matches'] = final_matches
    csv_name = tick + "_matches.csv"
    trial.to_csv(csv_name)
    return()

In [110]:
#connection to database:
server = ast.literal_eval(con.get("Setting","server"))
database = ast.literal_eval(con.get("Setting","database"))
username = ast.literal_eval(con.get("Setting","username"))
password = ast.literal_eval(con.get("Setting","password"))
cnxn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER='+server+';DATABASE='+database+';UID='+username+';PWD='+ password)
cursor = cnxn.cursor()

In [12]:

data = []
#function which get information of file using its path and return 5 elements(year, month,date,ticker code,analyst name)
def formating(filen):
    data = filen.replace(path, '').split('\\')
    del data[0]
    del data[3]
    if '-' in data[-1]:
        temp = (data[-1].split('.')[0]).split('-')
    elif '_' in data[-1]:
        temp = (data[-1].split('.')[0]).split('_')
    else:
        temp = (data[-1].split('.')[0]).split(' ')
    del data[-1]
    data.append(temp[0])
    data.append(temp[1])
    print(data)
    return(data)

In [13]:

#defined variable which help us to recognize year and quater of given column

year_pattern_int=[]
year_pattern_float=[]
year_pattern_2di=[]
quater_pattern=ast.literal_eval(con.get("Setting","quater_pattern"))
bscf_names=ast.literal_eval(con.get("Setting","bscf_names"))
#bscf_names=["balancesheet","cashflows","bs&cf","cf&bs","bsheet","balancesheet&cashflow","cashflow&balance sheet","cash&balance","adjustedbs","annualbs&cf","annualcf&bs"]

check_list = ast.literal_eval(con.get("Setting","check_list"))
for i in range(2000,2031):
    year_pattern_int.append(i)
    year_pattern_float.append(float(i))
    if i-2000<10:
        year_pattern_2di.append('0'+str(i-2000))
    else:
        year_pattern_2di.append(str(i-2000))

In [158]:
# type of main function

def function1(excel_file,path_list):
    #read excel file using openpyxl
    wb=opx.load_workbook(excel_file,data_only=True)
    sheet_tobechecked=wb.sheetnames #getting all the sheet name
    nonhidden=[]
    startrow={}
    print("All the sheets prestent in the file are: ")
    print(sheet_tobechecked)
    #this part helps to ignore hidden sheets and to take related to BS , Cf and IS
    names=[]
    for i in range(0, len(sheet_tobechecked)):
        curr_sheet = wb[sheet_tobechecked[i]]
        if curr_sheet.sheet_state != 'hidden':
            nonhidden.append(sheet_tobechecked[i])
            if sheet_tobechecked[i].lower()=='bs' or sheet_tobechecked[i].lower()=='cf' or sheet_tobechecked[i].lower()=='model':
                names.append(sheet_tobechecked[i])
            else:
                count_nobscf=1
                for nam in bscf_names:
                    if fuzz.partial_token_set_ratio(sheet_tobechecked[i].lower(),nam)>=80:
                        names.append(sheet_tobechecked[i])
    
    sheet_tobechecked = names # all the sheet which are important to us
    
    #if no sheet found then return giving error as sheet_name_fault
    if len(sheet_tobechecked)<=0:
        return (2) # that means there is problem
        '''print(nonhidden)
        while True:
            sheee=input("Enter the sheet name U want to process from above or for exit input'e' ")
            if sheee!='e':
                sheet_tobechecked.append(sheee)
            else:
                break'''
    
    sheet_tobechecked=list(set(sheet_tobechecked))# to remove repeated sheet names
    print("sheet to be checked")
    print(sheet_tobechecked)
    
        
    #defining variable
    year_pre,quater_pre,q4_check_pre='','',0
    
    #unmerging all cells of every sheet of a file
    for every_sheet in sheet_tobechecked:
        
        startrow_no=startingrow(wb,every_sheet)-1
        if startrow_no<0:
            startrow[every_sheet]=0
        else:
            startrow[every_sheet]=startrow_no
        
        curr_sheet=wb[every_sheet]
        merge_list=copy.deepcopy(curr_sheet.merged_cells.ranges)
        for group in merge_list :
            split_arr = group.coord.split(':')
            min_col, min_row, max_col, max_row = range_boundaries(group.coord)
            top_left_cell_value = curr_sheet[split_arr[0]].value
            curr_sheet.unmerge_cells(group.coord)
            for row in curr_sheet.iter_rows(min_col=min_col, min_row=min_row, max_col=max_col, max_row=max_row):
                for cell in row:
                    cell.value = top_left_cell_value
    wb.save(excel_file) #the modified file is been overwritten (have to look over it afterward by changing path)
    #print("excel")
    #display(excel_file)
    for sheetno in range(0,len(sheet_tobechecked)):
        #print(sheet_tobechecked[sheetno])
        address_dataframe=pd.DataFrame(columns=['q1','q2','q3','q4','tl','Ex']) # defining lookup table
        excel_data = pd.read_excel(excel_file,sheet_name=sheet_tobechecked[sheetno],header=None,skiprows=[i for i in range(0,startrow[sheet_tobechecked[sheetno]])])
        pd.options.display.max_columns = None
        pd.options.display.max_rows=None
        #print("This is excel data")
        #display(excel_data)
        
        #formating the dataframe by removing column and row having less than 10 element
        excel_data=excel_data.replace(0,np.nan)
        excel_data=excel_data.dropna(axis=0,thresh=10)
        excel_data=excel_data.dropna(axis=1,thresh=10)
        excel_data=excel_data.reset_index(drop=True)
        if(len(excel_data.columns)==0):
            continue # this line was added to handle exceptions in the code
        excel_data.columns = range(excel_data.shape[1])
        pd.options.display.max_columns = None
        pd.options.display.max_rows=None
        #display(excel_data)
        startrowno=0
        print("..........10%")
        #getting defination of each column
        print(len(excel_data.columns))
        if len(excel_data.columns)>10: #changed from 10 to 3
            temp_dataframe=excel_data[:10] # the first 10 element of a column will tell us about it 
            for j in temp_dataframe:
                list_ele=list(temp_dataframe[j])
                knowledge=[]
                colno=j
                for i in list_ele:
                    #overlook element if its nan,none, or weeks or days written in it
                    if str(i)=='nan' or str(i)=='None' or type(i)==datetime.datetime or "week" in str(i) or "day" in str(i):
                        a=1
                    #take only element which are keywords to us (like FY2017,3Q17 etc.) or else break which means any value have been occured
                    elif (type(i)==float and i not in year_pattern_float) or (type(i)==int and i not in year_pattern_int):
                        startrowno=list_ele.index(i)
                        break
                    else:
                        knowledge.append(i)
                
                # proces further if the list taken for defining the row is not empty 
                if len(knowledge)>0:
                    
                    year_got,quater_got,q4_check_got=about_q_year(knowledge)
                        
                    #here is a small assumtion (if we got Q4 and all the elementused to define column is same we will take the curent row as Total of particuar year) )
                    if q4_check_got==1 and year_got==year_pre and quater_got==quater_pre and q4_check_got==q4_check_pre:
                        year_final=year_got
                        quater_final='TL'
                        q4_check_final=1
                    else:
                        # or else everything will be consider as it was given has been found about it
                        year_pre=year_got
                        quater_pre=quater_got
                        q4_check_pre=q4_check_got
                        year_final=year_got
                        quater_final=quater_got
                        q4_check_final=q4_check_got                       
                    
                    #if only year is written and nothing about the quater we take that as Total for particular year
                    if year_got!='' and (quater_got=='' or quater_got=='TL' or quater_pre=='TL' or quater_pre==''):
                        quater_final='TL'
                    
                    #printing and making dataframe(lookup table) of information of each columns
                    if year_final!='' and quater_final!='':
                        got_cor=1 #means we got something
                        #print(knowledge,"===",end="")
                        #print("belongs to "+"20"+year_final," "+quater_final)
                        if '1' in quater_final:
                            qval='q1'
                        elif '2' in quater_final:
                            qval='q2'
                        elif '3' in quater_final:
                            qval='q3'
                        elif '4' in quater_final:
                            qval='q4'
                        else:
                            qval='tl'
                        try:
                            address_dataframe.loc["20"+year_final][qval]=[startrowno,colno]
                        except Exception:
                            address_dataframe.loc["20"+year_final]='Nan'
                            address_dataframe.loc["20"+year_final][qval]=[startrowno,colno]                           
                 
        #display(address_dataframe)
        print("..........20%")
        #db_connect()
        #extra fro shoeing rows which doesnot match
        not_present=pd.DataFrame(columns=excel_data.columns)
        coll=0
        
        #this is to make a list of year and its respective column number from lookup take which has to consider
        row_name_year=list(address_dataframe.index)
        row_name_year.sort()
        if int(path_list[0])<int(row_name_year[-1]):
            cur_yr=int(path_list[0])
            count_yr=0
            count = 0
            metric_col=[]
            par_year=[]
            metric_row=20
            year_tosearch=cur_yr
            
            lowest_year=min_year("'"+path_list[3]+"'")

            while (count_yr<6 and year_tosearch>=lowest_year):
                year_tosearch=cur_yr-(count_yr+1)
                val=address_dataframe['q1'][str(year_tosearch)]
                if val!='Nan':
                    if val[0]<metric_row:
                        metric_row=val[0]
                    metric_col.append(val[1])
                    par_year.append(year_tosearch)
                    count_yr+=1
            print("The years that will be taken into account")
            print(par_year)
            print("The columns that we will be using for the match")
            print(metric_col)
            print("The row at which the metric names begin: ")
            print(metric_row)
            print("..........30%")
                

            all_metric=set()
            def_metrics = []
            matched_metric = []
            mid_matched =[]
            maybe_metrics = []
            no_metrics = []
            if(type(excel_data.iloc[metric_row][0])==str):
                c = 0
            else:
                c = 1
            metric_list =[]    
            list_subs_found =[]
            for rowss in range(metric_row,excel_data.shape[0]):
                metric_found=[]
                s_var = ['Macau','Venetian']
                list_metric_found=[]
                com_met=set()
                a_metric=str(excel_data.iloc[rowss][c])
                flag_sub = 0
                for i in s_var:
                    if i in a_metric:
                        s = i
                        flag_sub = 1
                if flag_sub==0:
                    if rowss>metric_row+5:
                        for i in range(1,5):
                            for j in s_var:
                                if j in str(excel_data.iloc[rowss-i][c]):
                                    s=j
                                    flag_sub =1
                            if flag_sub==1:    
                                    break
                if flag_sub==0: 
                    s = "Unknown"
                for met_num in range(0,6):
                    #getting the metric name wrt the year,quater,ticker and value send
                    metric,subs_list=get_metric_name(par_year[met_num],path_list[3],excel_data.iloc[rowss][metric_col[met_num]],a_metric)
                    #remove this if it fucks up
                    for i in range(0,len(metric)):
                        metric[i] = metric[i] +"["+str(subs_list[i])+"]"
                    metric = set(metric)
                    subs_list = set(subs_list)
                    com_met.update(metric)
                    metric_list.extend(metric)
                    list_metric_found.extend(metric)
                    list_subs_found.extend(subs_list)
                if com_met:
                    spinning_cursor()
                    #print(com_met)
                    #print(list_metric_found)
                for un_met in com_met:
                    #if min 60% of them says that yes the values are of  particlar metric we take it 
                    if list_metric_found.count(un_met)/6 >= 0.6:
                        a = un_met +"--->"+a_metric+ "--->"+ str(rowss) +"--->"+ s
                        metric_found.append(un_met)
                        matched_metric.append(un_met)
                        def_metrics.append(a)
                    elif list_metric_found.count(un_met)/6 >= 0.4 and list_metric_found.count(un_met)/6 <0.6:
                        if(un_met not in matched_metric): 
                            mid_matched.append(un_met)
                            a = un_met +"--->"+a_metric+ "--->"+ str(rowss) +"--->"+ s
                            maybe_metrics.append(a)
                    elif list_metric_found.count(un_met)/6 < 0.4:
                        if(un_met not in matched_metric and un_met not in mid_matched):
                            no_metrics.append(un_met)
                if metric_found:
                    #print(rowss,metric_found)
                    all_metric.update(metric_found)
                else:
                    not_present.loc[coll]=list(excel_data.loc[rowss])
                    coll+=1
                
            #print(all_metric,len(all_metric))#printing all mertric found in database 
            print("..........90%")
            #metric_db=get_metriclist_from_db(path_list[0],path_list[3])
            #print("metric not in actuals---")
            #print(list(set(metric_db)-set(all_metric)))# all metric we couldn't find wrt to a ticker
            #print("metric not with respect to analyst")
            #print(list(set(get_metriclist_wrt_analyst(path_list[3],path_list[4]))-set(all_metric)))#metric which we couldn't finf wrt to analyst
            # the percentge accuracy will be calculate wby no of metric_found by us divided by total number of metric wrt analyst 
            #print()
            #print()
            #print("ACCURACY==")
            #all_metric = list(all_metric)
            #print("Number of total element in Actual DB=", len(metric_db))
            #print("Number of metric found by us=",len(all_metric))
            #for i in range(0,len(all_metric)):
            #    all_metric[i] = all_metric[i].replace(all_metric[i][all_metric[i].find("[")+1:all_metric[i].find("]")],"").strip("][")
            #print("accuracy wrt to Actual=",len(list(set(metric_db)&set(all_metric)))*100/len(metric_db))
            #print()
            #print("Number of total element in Estimated DB wrt Analyst=", len(get_metriclist_wrt_analyst(path_list[3],path_list[4])))
            #z=set(get_metriclist_wrt_analyst(path_list[3],path_list[4]))
            #print("Number of metric found by us=",len(z&set(all_metric)))
            #print("Accuracy with respect to estimates=",len(z&set(all_metric))*100/len(z))
            print("list of definate metrics \n", list(set(def_metrics)))
            print()
            print("list of semi-definate metrics \n", list(set(maybe_metrics)))
            print()
            print("list of Unmatched metrics \n", list(set(no_metrics)))
            m_metrics = list(set(maybe_metrics))
            d_metrics = list(set(def_metrics))
            print()
            print("The partially matched metrics can be mapped as so")
            print()
            for metric in m_metrics:
                poss = []
                poss = metric.split("--->")
                col=[c]
                for i in range(0,6):
                    col.append(metric_col[i])
                temp_metric = pd.DataFrame()
                temp_metric=temp_metric.append(excel_data.loc[[int(poss[2])],col[0:7]])
                temp_metric.rename(columns={col[0]:'Name',col[1]:str(par_year[0])+'Q1',col[2]:str(par_year[1])+'Q1',col[3]:str(par_year[2])+'Q1',col[4]:str(par_year[3])+'Q1',col[5]:str(par_year[4])+'Q1',col[6]:str(par_year[5])+'Q1'},inplace=True)
                yr = str(par_year[0:6]).strip('][').replace(" ,","")
                #display(temp_metric)
                sub = int(poss[0][poss[0].find("[")+1:poss[0].find("]")])
                poss0 = poss[0].replace(poss[0][poss[0].find("[")+1:poss[0].find("]")],"").strip("][")
                select_stmt1 = F"select value from dbo.cc_actual_metrics_consolidated where " \
                    F"metric_name='{poss0}' and subsidiary_id ={sub} and quarter = 'Q1' and ticker_code ='{path_list[3]}' and financial_year in (select convert(int,id) from [adm_fnSplitter]('{yr}')) order by financial_year"  
                cursor.execute(select_stmt1)
                row = cursor.fetchone()
                m_l =[]
                m_l1 = [poss0]
                while row:
                    m_l.append(str(row.value))
                    row= cursor.fetchone()
                m_l.reverse()
                m_l1.extend(m_l)
                temp_metric = temp_metric.append(pd.Series(m_l1, index=['Name',str(par_year[0])+'Q1',str(par_year[1])+'Q1',str(par_year[2])+'Q1',str(par_year[3])+'Q1',str(par_year[4])+'Q1',str(par_year[5])+'Q1']), ignore_index=True) 
                types = ["Analyst metric","Database metric"]
                temp_metric['Type'] = types
                #temp_metric=temp_metric.set_index('Type')
                display(temp_metric)
                #print(m_l)  
                #print(f"{'DB metric name and subsidiary id =':<30}{poss[0]:>15}",
                      #f"\n{'Analyst metric name =':<30}{poss[1]:>15}",
                      #f"\n{'Row Number in excel =':<30}{poss[2]:>15}",
                      #f"\n{'Row Number in excel =':<30}{poss[3]:>15}")
                print("DB metric name and subsidiary id: \n" + poss[0])
                print("Analyst metric name: \n" + poss[1])
                print("Row Number in excel: \n" + poss[2])
                print("Subsidiary Name from Analyst: \n" + poss[3])
                ip = input("enter [Y]es if you think this is a valid match and [N]o if you think it can be bypassed")
                if(ip is "Y"):
                    def_metrics.append(metric)
                else:
                    continue
            #matched_df = pd.DataFrame()
            print("the def matched metrics are")
            for m in d_metrics:
                poss = []
                poss = m.split("--->")
                col=[c]
                an_metric = pd.DataFrame(columns = ['Name',str(par_year[0])+'Q1',str(par_year[1])+'Q1',str(par_year[2])+'Q1',str(par_year[3])+'Q1',str(par_year[4])+'Q1',str(par_year[5])+'Q1'])
                temp_metric = pd.DataFrame()
                columns = ['Name',str(par_year[0])+'Q1',str(par_year[1])+'Q1',str(par_year[2])+'Q1',str(par_year[3])+'Q1',str(par_year[4])+'Q1',str(par_year[5])+'Q1']
                for i in range(0,6):
                    col.append(metric_col[i])
                temp_metric=temp_metric.append(excel_data.loc[[int(poss[2])],col[0:7]])
                temp_metric.rename(columns={col[0]:'Name',col[1]:str(par_year[0])+'Q1',col[2]:str(par_year[1])+'Q1',col[3]:str(par_year[2])+'Q1',col[4]:str(par_year[3])+'Q1',col[5]:str(par_year[4])+'Q1',col[6]:str(par_year[5])+'Q1'},inplace=True)
                #display(temp_metric)  
                inx = metric_list.index(poss[0])
                sub = int(poss[0][poss[0].find("[")+1:poss[0].find("]")])
                poss0 = poss[0].replace(poss[0][poss[0].find("[")+1:poss[0].find("]")],"").strip("][")
                #print(sub)
                if sub is not None and sub is not "None":    
                    select_stmt1 = F"select value from dbo.cc_actual_metrics_consolidated where " \
                        F"metric_name = '{poss0}' and subsidiary_id = {sub} and ticker_code = '{path_list[3]}' and quarter = 'Q1' and financial_year in (select convert(int,id) from [adm_fnSplitter]('2012,2013,2014,2015,2016,2017')) order by financial_year"
                else:
                    select_stmt1 = F"select value from dbo.cc_actual_metrics_consolidated where " \
                        F"metric_name = '{poss0}' and ticker_code = '{path_list[3]}' and quarter = 'Q1' and financial_year in (select convert(int,id) from [adm_fnSplitter]('2012,2013,2014,2015,2016,2017')) order by financial_year"
                cursor.execute(select_stmt1)
                row = cursor.fetchone()
                m_l =[]
                m_l1 = [poss0]
                while row:
                    m_l.append(str(row.value))
                    row= cursor.fetchone()
                m_l.reverse()
                m_l1.extend(m_l)
                temp_metric = temp_metric.append(pd.Series(m_l1, index=['Name',str(par_year[0])+'Q1',str(par_year[1])+'Q1',str(par_year[2])+'Q1',str(par_year[3])+'Q1',str(par_year[4])+'Q1',str(par_year[5])+'Q1']), ignore_index=True) 
                types = ["Analyst metric","Database metric"]
                temp_metric['Type'] = types
                #temp_metric=temp_metric.set_index('Type')
                display(temp_metric)
                #print(m_l)
                #print(f"{'DB metric name and subsidiary id =':<30}{poss[0]:>15}",
                      #f"\n{'Analyst metric name =':<30}{poss[1]:>15}",
                      #f"\n{'Row Number in excel =':<30}{poss[2]:>15}",
                      #f"\n{'Row Number in excel =':<30}{poss[3]:>15}")
                print("DB metric name and subsidiary id: \n" + poss[0])
                print("Analyst metric name: \n" + poss[1])
                print("Row Number in excel: \n" + poss[2])
                print("Subsidiary Name from Analyst: \n" + poss[3])
                #matched_df = matched_df.append(excel_data.loc[[int(poss[2])],col[0:7]], ignore_index = True)
            print()
            #print("The definately matched metrics are")
            print()
            #display(matched_df)
            #print("The matches made are")
            #for m in def_metrics:
            #   print(m)
            #display(not_present)
    
    if got_cor:
        return 0
    else:
        return 1
   
    '''qw=input()
            if qw=='q':
                sys.exit()'''

In [40]:

#get the minimum year present in dtabase for given ticker
def min_year(ticker):
    select_stmt1 = F" select distinct financial_year from dbo.cc_actual_metrics_consolidated where ticker_code={ticker} order by financial_year"
    cursor.execute(select_stmt1)
    row = cursor.fetchone()
    res_array = []
    while row:
        res_array.append(row[0])
        row = cursor.fetchone()
    print(res_array[0])
    return(res_array[0])

In [41]:
def get_metric_name (year,ticker,value,a_metric,quarter='Q1'):
    flag = 0
    flag_not_found = 1
    possible_list = ""
    try:
        index = ticker_dictionary[ticker_dictionary['trial']==a_metric].index.item()
        possible_list = ticker_dictionary['matches'][index]
        param = possible_list.strip("][").replace("'","").replace(", ",",").replace(" ,",",")
        flag = 1
    except:
        pass
    #Also write a conditional if statement for the case of an empty list 
    ticker_code = "'"+ticker+"'"
    year = year
    quarter = "'"+quarter+"'"
    if type(value)==int or (type(value)==float and str(value)!='nan'):
        if abs(value)>=1:
            #when value is greater than 1
            valueo= "'"+str(value)+"'" #orginal value
            value1 = "'"+str(int(value))+".%"+"'" # integered value
            value2 = "'"+str(round(value, 2))+"%"+"'" #value when rounded upto 2
            value3 = "'"+str(-1*int(value))+".%"+"'" #integered with negation
            value4 = "'"+str(-1*round(value,2))+"%"+"'" # round upto 2 with negation
            #print(valueo,value1,value2,value3,value4)
            if(len(possible_list)>2 and flag==1):
                select_stmt1 = F"select distinct metric_name, subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"metric_name in (select id from [adm_fnSplitter]('{param}')) and " \
                    F"ticker_code={ticker_code} and financial_year = {year} and quarter = {quarter} and " \
                    F"(value like {valueo} or value like {value1} or value like {value2} or value like {value3} or value like {value4})"   
            else:
                select_stmt1 = F"select distinct metric_name, subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"ticker_code={ticker_code} and financial_year = {year} and quarter = {quarter} and " \
                    F"(value like {valueo} or value like {value1} or value like {value2} or value like {value3} or value like {value4})"
            subs_list = []    
            metric_list=[]
            cursor.execute(select_stmt1)
            row = cursor.fetchone()
            while row:
                flag_not_found = 0
                metric_list.append(row.metric_name)
                subs_list.append(row.subsidiary_id)
                row = cursor.fetchone()
        else:
            #if value less than 1
            valueo= "'"+str(value*100)+"'" #orginal with 100 multiplied
            value1 = "'"+str(int(value*100))+".%"+"'" # multiply by 100 and then integered
            value3 = "'"+str(-1*int(value*100))+".%"+"'" # multiply by 100 and integer and negate it
            #print("with 100",valueo,value1,value3)
            if(len(possible_list)>2 and flag==1):
                select_stmt1 = F"select distinct metric_name, subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"metric_name in (select id from [adm_fnSplitter]('{param}')) and " \
                    F"ticker_code={ticker_code} and financial_year = {year} and quarter = {quarter} and " \
                    F"(value like {valueo} or value like {value1} or value like {value3})"
            else:
                select_stmt1 = F"select distinct metric_name, subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"ticker_code={ticker_code} and financial_year = {year} and quarter = {quarter} and " \
                    F"(value like {valueo} or value like {value1} or value like {value3})"
            subs_list = []    
            metric_list=[]
            cursor.execute(select_stmt1)
            row = cursor.fetchone()
            flag_got_with_100=0
            while row:
                metric_list.append(row.metric_name)
                subs_list.append(row.subsidiary_id)
                row = cursor.fetchone()
                flag_got_with_100=1

            #if not flag_got_with_100:
            valueo = "'"+str(value)+"'" #orginal value
            value1 = "'"+str(round(value,2))+"%"+"'" # round upto 2
            value3 = "'"+str(-1*round(value,2))+"%"+"'" # round upto 2  and negate it
            #print("without 100",valueo,value1,value3)
            if(len(possible_list)>2 and flag==1):
                select_stmt1 = F"select distinct metric_name, subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"metric_name in (select id from [adm_fnSplitter]('{param}')) and " \
                    F"ticker_code={ticker_code} and financial_year = {year} and quarter = {quarter} and " \
                    F"(value like {valueo} or value like {value1} or value like {value3})"
            else:
                select_stmt1 = F"select distinct metric_name, subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"ticker_code={ticker_code} and financial_year = {year} and quarter = {quarter} and " \
                    F"(value like {valueo} or value like {value1} or value like {value3})"
            cursor.execute(select_stmt1)
            row = cursor.fetchone()
            while row:
                #to_confirm
                metric_list.append(row.metric_name)
                subs_list.append(row.subsidiary_id)
                row = cursor.fetchone()
                flag_not_found = 0
        if(flag_not_found == 1 and flag == 1):
            if abs(value)>=1:
                #when value is greater than 1
                valueo= "'"+str(value)+"'" #orginal value
                value1 = "'"+str(int(value))+".%"+"'" # integered value
                value2 = "'"+str(round(value, 2))+"%"+"'" #value when rounded upto 2
                value3 = "'"+str(-1*int(value))+".%"+"'" #integered with negation
                value4 = "'"+str(-1*round(value,2))+"%"+"'" # round upto 2 with negation
                select_stmt1 = F"select distinct metric_name, subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"metric_name not in (select id from [adm_fnSplitter]('{param}')) and " \
                    F"ticker_code={ticker_code} and financial_year = {year} and quarter = {quarter} and " \
                    F"(value like {valueo} or value like {value1} or value like {value2} or value like {value3} or value like {value4})"
                metric_list=[]
                subs_list = []
                cursor.execute(select_stmt1)
                row = cursor.fetchone()
                while row:
                    metric_list.append(row.metric_name)
                    subs_list.append(row.subsidiary_id)
                    row = cursor.fetchone()
            else:
                #if value less than 1
                valueo= "'"+str(value*100)+"'" #orginal with 100 multiplied
                value1 = "'"+str(int(value*100))+".%"+"'" # multiply by 100 and then integered
                value3 = "'"+str(-1*int(value*100))+".%"+"'" # multiply by 100 and integer and negate it  
                select_stmt1 = F"select distinct metric_name, subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"metric_name not in (select id from [adm_fnSplitter]('{param}')) and " \
                    F"ticker_code={ticker_code} and financial_year = {year} and quarter = {quarter} and " \
                    F"(value like {valueo} or value like {value1} or value like {value3})"
                metric_list=[]
                subs_list = []
                cursor.execute(select_stmt1)
                row = cursor.fetchone()
                flag_got_with_100=0
                while row:
                    metric_list.append(row.metric_name)
                    subs_list.append(row.subsidiary_id)
                    row = cursor.fetchone()
                    flag_got_with_100=1
                valueo = "'"+str(value)+"'" #orginal value
                value1 = "'"+str(round(value,2))+"%"+"'" # round upto 2
                value3 = "'"+str(-1*round(value,2))+"%"+"'" # round upto 2  and negate it
                select_stmt1 = F"select distinct metric_name, subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"metric_name not in (select id from [adm_fnSplitter]('{param}')) and " \
                    F"ticker_code={ticker_code} and financial_year = {year} and quarter = {quarter} and " \
                    F"(value like {valueo} or value like {value1} or value like {value3})"   
                cursor.execute(select_stmt1)
                row = cursor.fetchone()
                while row:
                    #to_confirm
                    metric_list.append(row.metric_name)
                    subs_list.append(row.subsidiary_id)
                    row = cursor.fetchone()
        return(metric_list,subs_list)
    else:
        return([],[])

In [42]:
#function which tells about the quater and year the particular column belongs to
def about_q_year(checkar):
    
    checkar_duplicate=np.copy(checkar)
    quater=''
    year=''
    year_flag=0
    quater_flag=0
    q4_check=0
    checkar=[]
    datetime_flag=1
    for i_che in checkar_duplicate:
        checkar.append(str(i_che))
    
    for i_che in range(0,len(checkar)):
        
        if not year_flag:
            #checking if year is presenr in (2017,2016 format)
            for j_y in year_pattern_int:
                if str(j_y) in checkar[i_che]:
                    year=str(j_y)[2:]
                    checkar[i_che]=checkar[i_che].replace(str(j_y),'')
                    checkar[i_che]=checkar[i_che].replace(year,'')
                    year_flag=1
                    break
        if not year_flag:
            #checking if the year is present in 2 digited format like 17,16)
            for j_y in year_pattern_2di:
                if str(j_y) in checkar[i_che]:
                    year=str(j_y)
                    checkar[i_che]=checkar[i_che].replace(year,'')
                    year_flag=1
                    break

        if not quater_flag:
            # getting info about the quater
            for i_p in quater_pattern:
                checkar[i_che]=checkar[i_che].replace(year,'')
                checkar[i_che]=checkar[i_che].replace("20"+year,'')
                if i_p in checkar[i_che].lower():
                    quater=i_p
                    quater_flag=1
                    break       
        
        if year_flag and quater_flag:
            break
    #returning the year and quater and if its 4th quatered or not
    return(year,quater,q4_check)

In [43]:
# funtion to avoid te rough work present in top and retutn the row no from which its important
def startingrow(wb,sheet_name):
    curr_sheet = wb[sheet_name]
    flag = 0
    row = 0
    for col in curr_sheet.iter_cols(max_col=20,max_row=15):
        for cell in col:
            if cell.value is not None:
                for data in check_list:
                    if fuzz.partial_ratio(str(data),str(cell.value)) == 100:
                        row = cell.row
                        flag =1
                        break
                if flag == 1:
                    break
        if flag == 1:
            break

    print(row)
    return(row)

In [44]:
#function which return all the metric anme with repect to ticker in actuals
def get_metriclist_from_db(year, ticker):

    ticker_code = "'"+ticker+"'"
    year = year
    select_stmt1 = F"select distinct metric_name from dbo.cc_actual_metrics_consolidated where ticker_code = {ticker_code} " \
        F" and financial_year = {year}"

    cursor.execute(select_stmt1)
    row = cursor.fetchone()
    metric_list_comp = []
    while row:
        metric_list_comp.append(row[0])
        row = cursor.fetchone()

    return (metric_list_comp)

In [45]:
#function which return aall the metric name wrt to analyst from estimated database
def get_metriclist_wrt_analyst(ticker,analyst):
    ticker_code = "'"+ticker+"'"
    analyst_name="'%"+analyst+"%'"
    select_stmt1 = F" select distinct metric_name from [dbo].[cc_metrics_consolidated] where ticker_code = {ticker_code} and quarter='q1' and analyst_name like {analyst_name} order by metric_name"
    cursor.execute(select_stmt1)
    row = cursor.fetchone()
    res_array = []
    while row:
        res_array.append(row[0])
        row = cursor.fetchone()
    return(res_array)

In [159]:
filen="C:\\trial\\2018\\may\\2 MAY\\lvs\\AAP-McClintock.xlsx"
print(filen)
path_list=formating(filen)    
print("The current ticker that is detected is ", path_list[3])
ticker_input = input("Would you like to proceed with this ticker? [Y]//[N]")
if(ticker_input is "Y"):
    ticker_name = path_list[3]
else:
    ticker_name = input("please enter the ticker code")
ticker_name = ticker_name.lower()
a = corpus_list
csv_file = ticker_name +"_matches.csv"
a = list(map(lambda x: x.replace("C:\\Users\\admin\\thapovan\\Thapovan2\\Corpus\\",''),a))
if(csv_file in a):
    print("The dictionary has already been built")
else:
    ticker_list.append(ticker_name.lower())
    
    ticker_dictionary_build(ticker_name)
    csv_file = ticker_name +"_matches.csv" 
ticker_dictionary = pd.read_csv(csv_file, error_bad_lines=False)
val=function1(filen,path_list)
if val==1:
    print("FAULT")
elif val==2:
    print("fault with sheet name")

C:\trial\2018\may\2 MAY\lvs\AAP-McClintock.xlsx
['2018', 'may', '2 MAY', 'AAP', 'McClintock']
The current ticker that is detected is  AAP
Would you like to proceed with this ticker? [Y]//[N]
please enter the ticker codelvs
The dictionary has already been built
All the sheets prestent in the file are:
['ModelCover', 'Model', 'Quarterly Review', 'Segment', 'Share Repurchase', 'Metrics', 'Disclosures', 'Leases', 'Foresight']
sheet to be checked
['Model']
7
..........10%
103
..........20%
2008
The years that will be taken into account
[2017, 2016, 2015, 2014, 2013, 2012]
The columns that we will be using for the match
[83, 78, 73, 68, 63, 58]
The row at which the metric names begin:
2
..........30%
|..........90%
list of definate metrics
 ['Gross Profit[0]--->Gross Profit--->6--->Unknown', 'Accounts Receivable[0]--->Accounts Receivables--->36--->Unknown', 'Total Current Assets[0]--->Total Current Assets--->39--->Unknown', 'Cash & Short Term Equivalents[0]--->Cash at the end of the period--->92--->Unknown', 'Diluted Shares Outstanding[0]--->Diluted WASO--->30--->Unknown', 'Pro-Forma Earnings Per Share[0]--->EPS--->28--->Unknown', 'Total Liabilities[0]--->Total Liabilities--->49--->Unknown', 'Accounts Payable[0]--->Accounts Payable--->44--->Unknown', 'Total Assets[0]--->Total Assets--->42--->Unknown', 'Operating Margin (% of Total Revenues)[0]--->Operating Margin--->16--->Unknown', 'Total Assets[0]--->Total Liabilities & Equity--->51--->Unknown', 'Net Sales[0]--->Net Sales--->2--->Unknown', 'Tax Expense or (Gain)[0]--->Income Taxes--->22--->Unknown', 'Gross Margin (% of Total Revenues)[0]--->Gross Profit Margin--->8--->Unknown', 'Pre-Tax Profit[0]--->EBT--->20--->Unknown', 'Shareholder Equity[0]--->Equity--->50--->Unknown', 'Cash & Short Term Equivalents[0]--->Cash & Equivalents--->35--->Unknown', 'Total Capital Expenditures[0]--->Net Purchase of PP&E--->60--->Unknown', 'EBITDA[0]--->EBITDA--->31--->Unknown', 'Total Capital Expenditures[0]--->Net Purchase of PP&E--->80--->Unknown', 'Selling, General & Administrative (% of Total Revenues)[0]--->Operating Expense Rate--->12--->Unknown', 'Interest Expense[0]--->Net Interest Expense (Income)--->18--->Unknown', 'Cost of Sales[0]--->COGS--->4--->Unknown', 'Tax Rate[0]--->Tax Rate (%)--->23--->Unknown', 'Operating Cash Flow[0]--->Cash Flow from Operating Activities--->59--->Unknown', 'EBITDA Margin (% of Total Revenues)[0]--->EBITDA Margin--->33--->Unknown', 'Other Charges (Gains)[0]--->Other Expense (Income)--->19--->Unknown', 'Selling, General & Administrative[0]--->Operating Expenses--->10--->Unknown', 'Total Cost of Sales[0]--->COGS--->4--->Unknown', 'Total Revenues[0]--->Net Sales--->2--->Unknown', 'Operating Profit[0]--->Operating Income--->14--->Unknown', 'Property, Plant & Equipment[0]--->Net PP&E--->40--->Unknown', 'Operating Cash Flow[0]--->Cash Flow from Operating Activities--->79--->Unknown', 'Net Income[0]--->Net Income--->24--->Unknown', 'Net Margin (% of Total Revenues)[0]--->Net Margin--->26--->Unknown', 'Total Current Liabilities[0]--->Total Current Liabilities--->46--->Unknown', 'Inventories[0]--->Inventory--->37--->Unknown']

list of semi-definate metrics
 ['Current Ratio[0]--->EPS--->28--->Unknown', 'Debt to Equity Ratio[0]--->% Δ y/y--->3--->Unknown', 'Debt to Equity Ratio[0]--->EPS--->28--->Unknown']

list of Unmatched metrics
 ['Operating Cash Flow[0]', 'Pro-Forma Earnings Per Share[0]', 'Current Ratio[0]', 'Revenue Per Share[0]', 'Sales per Store [0]', 'Same Store Sales[0]', 'Operating Profit[0]', 'Pre-Tax Margin (% of Total Revenues)[0]', 'Free Cash Flow[0]', 'Other Charges (Gains)[0]', 'Cash Flow Per Share[0]', 'Net Margin (% of Total Revenues)[0]', 'Total Liabilities[0]', 'Ending Stores[689]', 'Ending Stores[1101]', 'Tax Rate[0]', 'Total Square Footage[0]', 'Total Capital Expenditures[0]', 'Interest Expense[0]', 'Total Operating Expenses[0]']

The partially matched metrics can be mapped as so

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,EPS,1.59741,2.5101,2.39,2.2554,1.68194,1.79439,Analyst metric
1,Current Ratio,1.4501,1.3473,1.2909,1.2668,1.2053,1.1873,Database metric

DB metric name and subsidiary id:
Current Ratio[0]
Analyst metric name:
EPS
Row Number in excel:
28
Subsidiary Name from Analyst:
Unknown
enter [Y]es if you think this is a valid match and [N]o if you think it can be bypassed

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,% Δ y/y,-0.0298479,-0.0192398,0.0231467,0.473474,0.0296389,0.031205,Analyst metric
1,Debt to Equity Ratio,1.7876,2.2098,2.7952,3.7479,2.7369,3.1334,Database metric

DB metric name and subsidiary id:
Debt to Equity Ratio[0]
Analyst metric name:
% Δ y/y
Row Number in excel:
3
Subsidiary Name from Analyst:
Unknown
enter [Y]es if you think this is a valid match and [N]o if you think it can be bypassed

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,EPS,1.59741,2.5101,2.39,2.2554,1.68194,1.79439,Analyst metric
1,Debt to Equity Ratio,1.7876,2.2098,2.7952,3.7479,2.7369,3.1334,Database metric

DB metric name and subsidiary id:
Debt to Equity Ratio[0]
Analyst metric name:
EPS
Row Number in excel:
28
Subsidiary Name from Analyst:
Unknown
enter [Y]es if you think this is a valid match and [N]o if you think it can be bypassed
the def matched metrics are

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Gross Profit,1270.68,1349.89,1393.92,1353.12,1008.21,980.673,Analyst metric
1,Gross Profit,1270.6900,1349.8890,1393.9200,1353.1200,1008.2000,980.6700,Database metric

DB metric name and subsidiary id:
Gross Profit[0]
Analyst metric name:
Gross Profit
Row Number in excel:
6
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Accounts Receivables,683.024,650.993,631.926,574.998,272.208,146.228,Analyst metric
1,Accounts Receivable,683.0200,650.9900,631.9300,576.6100,272.2100,146.2300,Database metric

DB metric name and subsidiary id:
Accounts Receivable[0]
Analyst metric name:
Accounts Receivables
Row Number in excel:
36
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Total Current Assets,5306.69,5266.23,4936.87,4640.91,3162.87,2669.83,Analyst metric
1,Total Current Assets,5306.6900,5266.2300,4936.8700,4641.7800,3162.8700,2669.8300,Database metric

DB metric name and subsidiary id:
Total Current Assets[0]
Analyst metric name:
Total Current Assets
Row Number in excel:
39
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Cash at the end of the period,126.087,103.708,123.821,83.358,407.724,364.084,Analyst metric
1,Cash & Short Term Equivalents,126.0900,103.7100,123.8200,83.3600,407.7200,364.0800,Database metric

DB metric name and subsidiary id:
Cash & Short Term Equivalents[0]
Analyst metric name:
Cash at the end of the period
Row Number in excel:
92
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Diluted WASO,74.093,73.847,73.653,73.355,73.806,74.223,Analyst metric
1,Diluted Shares Outstanding,74.0900,73.8500,73.6500,73.3600,73.0400,74.2200,Database metric

DB metric name and subsidiary id:
Diluted Shares Outstanding[0]
Analyst metric name:
Diluted WASO
Row Number in excel:
30
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,EPS,1.59741,2.5101,2.39,2.2554,1.68194,1.79439,Analyst metric
1,Pro-Forma Earnings Per Share,1.6000,2.5100,2.3900,2.2500,1.6700,1.7900,Database metric

DB metric name and subsidiary id:
Pro-Forma Earnings Per Share[0]
Analyst metric name:
EPS
Row Number in excel:
28
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Total Liabilities,5404.98,5809.82,6000.11,6260.31,3477.04,3066.46,Analyst metric
1,Total Liabilities,5404.9800,5809.8200,6000.1050,6246.4400,3477.0400,3066.4600,Database metric

DB metric name and subsidiary id:
Total Liabilities[0]
Analyst metric name:
Total Liabilities
Row Number in excel:
49
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Accounts Payable,3049.22,3318.05,3138.57,2967.86,2101.55,1737.34,Analyst metric
1,Accounts Payable,3049.2200,3318.0500,3138.5700,2975.9800,2101.5500,1737.3400,Database metric

DB metric name and subsidiary id:
Accounts Payable[0]
Analyst metric name:
Accounts Payable
Row Number in excel:
44
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Total Assets,8428.66,8438.96,8146.7,7926.95,4747.48,4045.11,Analyst metric
1,Total Assets,8428.6600,8438.9600,8146.6950,7913.0700,4747.4900,4045.1100,Database metric

DB metric name and subsidiary id:
Total Assets[0]
Analyst metric name:
Total Assets
Row Number in excel:
42
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Operating Margin,0.0708874,0.105717,0.101467,0.0957673,0.102103,0.114732,Analyst metric
1,Operating Margin (% of Total Revenues),7.0889,10.5717,10.1312,9.5767,10.1255,11.4730,Database metric

DB metric name and subsidiary id:
Operating Margin (% of Total Revenues)[0]
Analyst metric name:
Operating Margin
Row Number in excel:
16
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Total Liabilities & Equity,8428.66,8438.96,8146.69,7926.94,4747.48,4045.11,Analyst metric
1,Total Assets,8428.6600,8438.9600,8146.6950,7913.0700,4747.4900,4045.1100,Database metric

DB metric name and subsidiary id:
Total Assets[0]
Analyst metric name:
Total Liabilities & Equity
Row Number in excel:
51
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Net Sales,2890.84,2979.78,3038.23,2969.5,2015.3,1957.29,Analyst metric
1,Net Sales,2890.8400,2979.7780,3038.2300,2969.5000,2015.3000,1957.2900,Database metric

DB metric name and subsidiary id:
Net Sales[0]
Analyst metric name:
Net Sales
Row Number in excel:
2
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Income Taxes,64.575,113.092,108.116,95.897,71.93,81.706,Analyst metric
1,Tax Expense or (Gain),64.5800,113.0900,108.1000,95.9000,72.5800,81.7100,Database metric

DB metric name and subsidiary id:
Tax Expense or (Gain)[0]
Analyst metric name:
Income Taxes
Row Number in excel:
22
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Gross Profit Margin,0.439556,0.453017,0.458794,0.455673,0.500275,0.501036,Analyst metric
1,Gross Margin (% of Total Revenues),43.9557,45.3017,45.8793,45.5673,50.0273,50.1035,Database metric

DB metric name and subsidiary id:
Gross Margin (% of Total Revenues)[0]
Analyst metric name:
Gross Profit Margin
Row Number in excel:
8
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,EBT,182.932,299.194,284.594,261.342,196.067,215.212,Analyst metric
1,Pre-Tax Profit,182.9400,299.1940,284.1200,261.3400,194.3600,215.2100,Database metric

DB metric name and subsidiary id:
Pre-Tax Profit[0]
Analyst metric name:
EBT
Row Number in excel:
20
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Equity,3023.68,2629.14,2146.59,1666.63,1270.45,978.649,Analyst metric
1,Shareholder Equity,3023.6800,2629.1400,2146.5900,1666.6300,1270.4500,978.6500,Database metric

DB metric name and subsidiary id:
Shareholder Equity[0]
Analyst metric name:
Equity
Row Number in excel:
50
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Cash & Equivalents,126.087,103.708,123.821,83.358,407.724,364.084,Analyst metric
1,Cash & Short Term Equivalents,126.0900,103.7100,123.8200,83.3600,407.7200,364.0800,Database metric

DB metric name and subsidiary id:
Cash & Short Term Equivalents[0]
Analyst metric name:
Cash & Equivalents
Row Number in excel:
35
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Net Purchase of PP&E,-64.332,-89.138,-57.038,-60.529,-63.124,-82.463,Analyst metric
1,Total Capital Expenditures,65.2800,89.1400,57.0400,60.5300,63.1200,82.4600,Database metric

DB metric name and subsidiary id:
Total Capital Expenditures[0]
Analyst metric name:
Net Purchase of PP&E
Row Number in excel:
60
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,EBITDA,282.354,394.334,391.526,372.586,269.796,280.363,Analyst metric
1,EBITDA,282.4000,394.3340,391.5300,372.5900,269.8950,280.3600,Database metric

DB metric name and subsidiary id:
EBITDA[0]
Analyst metric name:
EBITDA
Row Number in excel:
31
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Net Purchase of PP&E,-64.332,-89.138,-57.038,-60.529,-63.124,-82.463,Analyst metric
1,Total Capital Expenditures,65.2800,89.1400,57.0400,60.5300,63.1200,82.4600,Database metric

DB metric name and subsidiary id:
Total Capital Expenditures[0]
Analyst metric name:
Net Purchase of PP&E
Row Number in excel:
80
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Operating Expense Rate,0.368668,0.347299,0.357328,0.359906,0.398172,0.386304,Analyst metric
1,"Selling, General & Administrative (% of Total ...",36.8668,34.7299,35.7481,35.9906,39.9018,38.6305,Database metric

DB metric name and subsidiary id:
Selling, General & Administrative (% of Total Revenues)[0]
Analyst metric name:
Operating Expense Rate
Row Number in excel:
12
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Net Interest Expense (Income),-18.43,-18.943,-21.777,-23.642,-10.66,-9.854,Analyst metric
1,Interest Expense,18.4300,18.9400,21.7800,23.6400,10.6600,9.8500,Database metric

DB metric name and subsidiary id:
Interest Expense[0]
Analyst metric name:
Net Interest Expense (Income)
Row Number in excel:
18
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,COGS,1620.15,1629.89,1644.31,1616.38,1007.1,976.619,Analyst metric
1,Cost of Sales,1620.1500,1629.8890,1644.3100,1616.3800,1007.1000,976.6200,Database metric

DB metric name and subsidiary id:
Cost of Sales[0]
Analyst metric name:
COGS
Row Number in excel:
4
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Tax Rate (%),0.353,0.377989,0.379896,0.366941,0.366864,0.379654,Analyst metric
1,Tax Rate,35.3012,37.7982,38.0473,36.6955,37.3431,37.9676,Database metric

DB metric name and subsidiary id:
Tax Rate[0]
Analyst metric name:
Tax Rate (%)
Row Number in excel:
23
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Cash Flow from Operating Activities,35.081,75.301,102.211,81.131,135.285,235.417,Analyst metric
1,Operating Cash Flow,35.0800,75.3010,102.2100,81.1300,135.2900,235.4200,Database metric

DB metric name and subsidiary id:
Operating Cash Flow[0]
Analyst metric name:
Cash Flow from Operating Activities
Row Number in excel:
59
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,EBITDA Margin,0.097672,0.132337,0.128866,0.125471,0.133874,0.14324,Analyst metric
1,EBITDA Margin (% of Total Revenues),9.7688,13.2337,12.8868,12.5472,13.3923,14.3239,Database metric

DB metric name and subsidiary id:
EBITDA Margin (% of Total Revenues)[0]
Analyst metric name:
EBITDA Margin
Row Number in excel:
33
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Other Expense (Income),-3.562,3.123,-1.908,0.603,0.958,0.502,Analyst metric
1,Other Charges (Gains),3.5600,-3.1200,1.9100,-0.6000,-0.9600,-0.5000,Database metric

DB metric name and subsidiary id:
Other Charges (Gains)[0]
Analyst metric name:
Other Expense (Income)
Row Number in excel:
19
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Operating Expenses,1065.76,1034.88,1085.64,1068.74,802.437,756.109,Analyst metric
1,"Selling, General & Administrative",1065.7600,1034.8750,1086.1100,1068.7400,804.1400,756.1100,Database metric

DB metric name and subsidiary id:
Selling, General & Administrative[0]
Analyst metric name:
Operating Expenses
Row Number in excel:
10
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,COGS,1620.15,1629.89,1644.31,1616.38,1007.1,976.619,Analyst metric
1,Total Cost of Sales,1620.1500,1629.8890,1644.3100,1616.3800,1007.1000,976.6200,Database metric

DB metric name and subsidiary id:
Total Cost of Sales[0]
Analyst metric name:
COGS
Row Number in excel:
4
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Net Sales,2890.84,2979.78,3038.23,2969.5,2015.3,1957.29,Analyst metric
1,Total Revenues,2890.8400,2979.7780,3038.2300,2969.5000,2015.3000,1957.2900,Database metric

DB metric name and subsidiary id:
Total Revenues[0]
Analyst metric name:
Net Sales
Row Number in excel:
2
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Operating Income,204.924,315.014,308.279,284.381,205.769,224.564,Analyst metric
1,Operating Profit,204.9300,315.0140,307.8100,284.3800,204.0600,224.5600,Database metric

DB metric name and subsidiary id:
Operating Profit[0]
Analyst metric name:
Operating Income
Row Number in excel:
14
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Net PP&E,1439.62,1432.7,1397.95,1425.92,1284.81,1233.69,Analyst metric
1,"Property, Plant & Equipment",1439.6200,1432.6980,1397.9500,1425.1200,1284.8100,1233.6900,Database metric

DB metric name and subsidiary id:
Property, Plant & Equipment[0]
Analyst metric name:
Net PP&E
Row Number in excel:
40
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Cash Flow from Operating Activities,35.081,75.301,102.211,81.131,135.285,235.417,Analyst metric
1,Operating Cash Flow,35.0800,75.3010,102.2100,81.1300,135.2900,235.4200,Database metric

DB metric name and subsidiary id:
Operating Cash Flow[0]
Analyst metric name:
Cash Flow from Operating Activities
Row Number in excel:
79
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Net Income,118.357,186.102,176.478,165.445,124.137,133.185,Analyst metric
1,Net Income,118.3600,186.1040,176.0200,165.4400,121.7800,133.5000,Database metric

DB metric name and subsidiary id:
Net Income[0]
Analyst metric name:
Net Income
Row Number in excel:
24
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Net Margin,0.0409421,0.062455,0.0580857,0.0557148,0.0615972,0.0680455,Analyst metric
1,Net Margin (% of Total Revenues),4.0943,6.2456,5.7935,5.5713,6.0428,6.8207,Database metric

DB metric name and subsidiary id:
Net Margin (% of Total Revenues)[0]
Analyst metric name:
Net Margin
Row Number in excel:
26
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Total Current Liabilities,3659.63,3908.56,3824.48,3672.78,2624.14,2248.71,Analyst metric
1,Total Current Liabilities,3659.6300,3908.6000,3824.4800,3664.2500,2624.1400,2248.7100,Database metric

DB metric name and subsidiary id:
Total Current Liabilities[0]
Analyst metric name:
Total Current Liabilities
Row Number in excel:
46
Subsidiary Name from Analyst:
Unknown

,Name,2017Q1,2016Q1,2015Q1,2014Q1,2013Q1,2012Q1,Type
0,Inventory,4413.8,4432.97,4104.78,3912.04,2423.77,2106.94,Analyst metric
1,Inventories,4413.8030,4432.9700,4104.7800,3910.9500,2423.7700,2106.9400,Database metric

DB metric name and subsidiary id:
Inventories[0]
Analyst metric name:
Inventory
Row Number in excel:
37
Subsidiary Name from Analyst:
Unknown

In [65]:




len(ticker_dictionary['matches'][2][1])

1

In [ ]:
glob.glob("C:\\Users\\admin\\thapovan\\Thapovan2\\Corpus\*csv")

In [ ]:
data.head()

In [ ]:
param = str(rohan).strip("][").replace("'","").replace(", ",",")

In [145]:
a = (ticker_dictionary['matches'][2]).strip("][").replace("'","").replace(", ",",")
a

'Net Income,RevPar,Slots'

In [26]:
select_stmt1 = F"select distinct subsidiary_id from dbo.cc_actual_metrics_consolidated where " \
                    F"metric_name = 'Property, Plant & Equipment' and quarter = 'Q1' and ticker_code = 'AAP' and financial_year = 2017 and value like 1439.6200"

In [27]:
 cursor.execute(select_stmt1)

In [28]:
b=str(cursor.fetchone())
#m = []
#while b:
#    m.append(str(b.subsidiary_name))
#    b= cursor.fetchone()

In [29]:
print(b)

(0, )

In [8]:
corpus_list.replace("C:\\Users\\admin\\thapovan\\Thapovan2\\Corpus\\","")

AttributeError: 'list' object has no attribute 'replace'

In [9]:
a = corpus_list

In [10]:
 a = list(map(lambda x: x.replace("C:\\Users\\admin\\thapovan\\Thapovan2\\Corpus\\",''),a))

In [49]:
print(b)

(Decimal('0.6206'), )

In [12]:
if("lvs_matches.csv" in a):
    print(1)

1

In [46]:
string = "rohan ---> Philip"

In [47]:
string.split("--->")

['rohan ', ' Philip']

In [70]:
data.head()

AttributeError: 'list' object has no attribute 'head'

In [83]:
data.iloc[1][0]

'100% Equities Strategy '

In [76]:
data.loc[[],'Term':'word_count']

,Term,Definition,word_count
2,100% Mortgage,100% mortgage is a mortgage loan in which the ...,41

In [75]:
d = pd.DataFrame()

In [78]:
d=d.append(data.loc[[2],'Term'], ignore_index =True)

In [79]:
value =

,Term,Definition,word_count
0,100% Mortgage,100% mortgage is a mortgage loan in which the ...,41

In [175]:
select_stmt1 = F"select metric_name from dbo.cc_actual_metrics_consolidated where " \
                    F"ticker_code = 'AAP' and (value like {valueo} or value like {value1} or value like {value3})"

In [173]:
value = -18.43
valueo= "'"+str(value*100)+"'" #orginal with 100 multiplied
value1 = "'"+str(int(value*100))+".%"+"'" # multiply by 100 and then integered
value3 = "'"+str(-1*int(value*100))+".%"+"'" # multiply by 100 and integer and negate it

In [145]:
print(value3)

'1066.%'

In [174]:
valueo = "'"+str(value)+"'" #orginal value
value1 = "'"+str(round(value,2))+"%"+"'" # round upto 2
value3 = "'"+str(-1*round(value,2))+"%"+"'" # round upto 2  and negate it

In [195]:
f= pd.DataFrame(columns=['A','B'])

In [197]:
f

Empty DataFrame
Columns: [A, B]
Index: []

In [23]:
def a():
    a = [1,2,3]
    b= [4,5,6]
    return(a,b)

In [24]:
r,s = a()

In [25]:
r

[1, 2, 3]

In [56]:
r = "rohan[56]"

In [55]:
r - "han"

TypeError: unsupported operand type(s) for -: 'str' and 'str'

In [57]:
r1 = r[r.find("[")+1:r.find("]")]

In [52]:
int(r1)

247

In [59]:
r.replace(r1,"")

'rohan[]'

In [76]:
a = [1,2,3,4]

In [49]:
import time

In [61]:
r =10     
r3 =10

In [65]:
print(f"{'r=':<15}{r:>5}",
      f"\n{'r3=':<15}{r3:>5}")

r=                10
r3=               10

In [136]:
students = [ ('jack', 34, 'Sydeny') ,
('Riti', 30, 'Delhi' ) ,
('Aadi', 16, 'New York') ]
# Create a DataFrame object
dfObj = pd.DataFrame(students, columns = ['Name' , 'Age', 'City'])

In [142]:
dfObj['a'] = a

In [138]:
i = dfObj.index.values
i

array([0, 1, 2], dtype=int64)

In [139]:
i[0] = "Bloh"

ValueError: invalid literal for int() with base 10: 'Bloh'

In [154]:
dfObj=dfObj.set_index('a')

In [131]:
a =['ab','b','c']

In [155]:
display(dfObj)

    Name  Age      City
a
ab  jack   34    Sydeny
b   Riti   30     Delhi
c   Aadi   16  New York

In [145]:
print(dfObj)

   Name  Age      City   a
0  jack   34    Sydeny  ab
1  Riti   30     Delhi   b
2  Aadi   16  New York   c

In [153]:
display(HTML(dfObj.to_html()))

In [151]:
from IPython.display import display, HTML

In [ ]:
excel_data.iloc[["Diluted WASO"][83]]/excel_data.iloc[[""][83]]